# PANDAS

## SERIE | DATAFRAMES | FUNCIONES

In [2]:
# SERIE
import pandas as pd
import numpy as np

In [4]:
# Una serie es un arreglo de una dimension
pd.Series([10, 20, 30, 40, 50])

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [5]:
# pd.Series([10, 20, 30, 40, 50],dtype=np.int32)
pd.Series([10, 20, 30, 40, 50],dtype=np.float32)

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float32

In [6]:
a = pd.Series([10, 20, 30, 40, 50],dtype=np.int32, index=['a','b','c','d','e'])

In [7]:
a['c']

30

In [8]:
diccionario = {
    'a':10,
    'b':200,
    'c':300
}

In [9]:
# DE DICCIONARIO A SERIE
b = pd.Series(diccionario)
b

a     10
b    200
c    300
dtype: int64

In [10]:
a = pd.Series(np.arange(4))
a

0    0
1    1
2    2
3    3
dtype: int32

In [11]:
# PONER NOMBRE A MI SERIE
a.name = 'Numeros'
a

0    0
1    1
2    2
3    3
Name: Numeros, dtype: int32

In [12]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
a.index.values

array([0, 1, 2, 3], dtype=int64)

In [14]:
a.index.tolist()

[0, 1, 2, 3]

In [15]:
a.index.name = 'indices'
a

indices
0    0
1    1
2    2
3    3
Name: Numeros, dtype: int32

In [16]:
# np.NaN

In [17]:
a = pd.Series([10, 20, np.NaN, 40, np.NaN])

In [18]:
# pd.isnull(a)
# pd.notnull(a)
a.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [19]:
a

0    10.0
1    20.0
2     NaN
3    40.0
4     NaN
dtype: float64

In [20]:
a.dropna() # NUEVA SERIE QUE ELIMINA LOS VALORES NULOS

0    10.0
1    20.0
3    40.0
dtype: float64

In [21]:
a.fillna(99)

0    10.0
1    20.0
2    99.0
3    40.0
4    99.0
dtype: float64

In [22]:
a[a.notnull()]

0    10.0
1    20.0
3    40.0
dtype: float64

In [23]:
# DATAFRAME
# pd.dataframe

usuarios = {
    'nombre':["mayu","shirley","ines","karina"],
    'calificaciones':[9,10,4,9.5],
    'edad':[23,17,20,34],
    'aprobado':[True, False, True, True]
}

In [24]:
usuarios

{'nombre': ['mayu', 'shirley', 'ines', 'karina'],
 'calificaciones': [9, 10, 4, 9.5],
 'edad': [23, 17, 20, 34],
 'aprobado': [True, False, True, True]}

In [25]:
import pandas as pd
users = pd.DataFrame(usuarios,index=['a','b','c','d'])

In [26]:
users = pd.DataFrame(usuarios,index=['a','b','c','d'],columns=['nombre','calificaciones'])
users

    nombre  calificaciones
a     mayu             9.0
b  shirley            10.0
c     ines             4.0
d   karina             9.5

In [27]:
users.columns = ['nombre1','calificaciones1']
users.index = '1a','2b','3c','4d'

In [28]:
users

    nombre1  calificaciones1
1a     mayu              9.0
2b  shirley             10.0
3c     ines              4.0
4d   karina              9.5

In [29]:
users.rename(columns={'nombre':'nameHM'})

    nombre1  calificaciones1
1a     mayu              9.0
2b  shirley             10.0
3c     ines              4.0
4d   karina              9.5

In [30]:
# apply
#df.apply(function, axis=1) #axis = 1 <> filas
users

    nombre1  calificaciones1
1a     mayu              9.0
2b  shirley             10.0
3c     ines              4.0
4d   karina              9.5

In [31]:
users.apply(lambda row: row['calificaciones1'] + 1 , axis=1)

1a    10.0
2b    11.0
3c     5.0
4d    10.5
dtype: float64

In [32]:
users['calificaciones1'] = users.apply(lambda row: row['calificaciones1'] + 1 , axis=1)

In [33]:
users

    nombre1  calificaciones1
1a     mayu             10.0
2b  shirley             11.0
3c     ines              5.0
4d   karina             10.5

## ARCHIVOS

In [41]:
# df = pd.read_csv('./datasets/users.csv', delimiter=",", header=5)
userdf = pd.read_csv('./datasets/users.csv', delimiter=",")
userdf.head(3)

,Unnamed: 0,nombre,edad,genero,pais,email
0,0,Mr Jerome Thomas,73,male,United States,jerome.thomas@example.com
1,1,Mr Gary Berry,70,male,United Kingdom,gary.berry@example.com
2,2,Mr Noham Dubois,40,male,France,noham.dubois@example.com

In [42]:
userdf.tail(3)

,Unnamed: 0,nombre,edad,genero,pais,email
197,197,Mr Gabriel Berger,40,male,France,gabriel.berger@example.com
198,198,Mrs Ülkü Tanrıkulu,37,female,Turkey,ulku.tanrikulu@example.com
199,199,Mr Raff Valkema,60,male,Netherlands,raff.valkema@example.com

In [46]:
paisesdf = pd.read_csv('./datasets/paises.csv', usecols=['pais','poblacion','long','lat'])
paisesdf.head(3)

         pais   poblacion        lat       long
0  Afganistán  29.121.286  33.000000  65.000000
1     Albania   2.986.952  41.333333  19.816667
2    Alemania  81.802.257  51.000000   9.000000
3     Andorra      84.000  42.500000   1.600000
4      Angola  13.068.161 -12.500000  18.500000

In [47]:
paisesdf = pd.read_csv('./datasets/paises.csv', 
                       usecols=['pais','poblacion','long','lat'],
                      na_values=['N/S'])

In [48]:
paisesdf.head(3)

         pais   poblacion        lat       long
0  Afganistán  29.121.286  33.000000  65.000000
1     Albania   2.986.952  41.333333  19.816667
2    Alemania  81.802.257  51.000000   9.000000

In [52]:
# paisesdf.poblacion.values

In [56]:
paises = paisesdf[paisesdf.poblacion.notnull()]

In [63]:
paises.head(3)

         pais  poblacion        lat       long
0  Afganistán   29121286  33.000000  65.000000
1     Albania    2986952  41.333333  19.816667
2    Alemania   81802257  51.000000   9.000000

In [62]:
paises.poblacion = paises.apply(lambda row: int(str(row['poblacion']).replace('.','')), axis=1)

In [ ]:
# Indices columnas

In [ ]:
paises

In [65]:
paises.sort_index(ascending=False)

           pais  poblacion        lat        long
240    Zimbabue   11651858 -20.000000   30.000000
239      Zambia   13460305 -15.000000   30.000000
238      Yibuti     740528  11.500000   43.000000
237       Yemen   23495361  15.000000   48.000000
235     Vietnam   89571130  16.000000  106.000000
..          ...        ...        ...         ...
4        Angola   13068161 -12.500000   18.500000
3       Andorra      84000  42.500000    1.600000
2      Alemania   81802257  51.000000    9.000000
1       Albania    2986952  41.333333   19.816667
0    Afganistán   29121286  33.000000   65.000000

[191 rows x 4 columns]

In [67]:
paises.sort_values('poblacion',ascending=False)

                    pais   poblacion      lat      long
42                 China  1330044000  35.0000  105.0000
92                 India  1173108018  20.0000   77.0000
64        Estados Unidos   310232863  38.0000  -97.0000
93             Indonesia   242968342  -5.0000  120.0000
29                Brasil   201103330 -10.0000  -55.0000
..                   ...         ...      ...       ...
150               Mónaco       32965  43.7333    7.4000
193           San Marino       31477  43.7667   12.4167
228               Tuvalu       10472  -8.0000  178.0000
156                Nauru       10065  -0.5333  166.9167
44   Ciudad del Vaticano         921  41.9000   12.4500

[191 rows x 4 columns]

In [72]:
# Crear archivos
# paises.to_csv('./datasets/paisesNew.csv')
# paises.to_csv('./datasets/paisesNew.csv',columns=['pais','poblacion']) # Solo algunas columnas
paises.to_csv('./datasets/paisesNew.csv', 
              columns=['pais','poblacion'],
              index=False
             )  # SIN INDICE

In [ ]:
# MODIFICAR DATAFRAME

In [3]:
# pd.DataFrame(np.arange(16).reshape(4,4))
df = pd.DataFrame(np.arange(16).reshape(4,4), 
             columns=list('ABCD'),
            index=list('abcd'))

In [77]:
df.B['b'] = 50

In [89]:
df

    A    Z   B   C   D
a   0  100  10   2   3
b   4  200  20   6   7
c   8  300  30  10  11
d  12  400  40  14  15

In [79]:
df['B']=10,20,30,40

In [81]:
# ELIMINAR la COLUMNA
df.drop('D', axis=1) # axis=1 <> Columnas

    A   B   C
a   0  10   2
b   4  20   6
c   8  30  10
d  12  40  14

In [83]:
# ELIMINAR la FILA
df.drop('b', axis=0)

    A   B   C   D
a   0  10   2   3
c   8  30  10  11
d  12  40  14  15

In [4]:
# INSERTAR NUEVA COLUMNA
df.insert(1,'Z',[100,200,300,400]) # SI MODIFICA al Dataframe

In [7]:
df

    A    Z   B   C   D
a   0  100   1   2   3
b   4  200   5   6   7
c   8  300   9  10  11
d  12  400  13  14  15

In [6]:
df.assign(Z2 =[100,200,300,400])

    A    Z   B   C   D   Z2
a   0  100   1   2   3  100
b   4  200   5   6   7  200
c   8  300   9  10  11  300
d  12  400  13  14  15  400

## loc

In [122]:
usuarios = {
    'nombre':["mayu","shirley","ines","karina",'marilu'],
    'calificaciones':np.random.randint(5,10,5),
    'edad':np.random.randint(15,30,5),
    'email':["mayu@aa","shirley@aa","ines@bb","karina@bb",'marilu@aa'],
    'aprobado':[True, False, True, True, False]
}

In [123]:
pd.DataFrame(usuarios)

    nombre  calificaciones  edad       email  aprobado
0     mayu               7    16     mayu@aa      True
1  shirley               8    29  shirley@aa     False
2     ines               7    24     ines@bb      True
3   karina               7    18   karina@bb      True
4   marilu               8    23   marilu@aa     False

In [124]:
# Renombrando indice
df = pd.DataFrame(usuarios, index=list('abcde'))
df

    nombre  calificaciones  edad       email  aprobado
a     mayu               7    16     mayu@aa      True
b  shirley               8    29  shirley@aa     False
c     ines               7    24     ines@bb      True
d   karina               7    18   karina@bb      True
e   marilu               8    23   marilu@aa     False

In [125]:
df.loc['a':'c','nombre']

a       mayu
b    shirley
c       ines
Name: nombre, dtype: object

In [126]:
df.loc['a':'c',['nombre','edad']]

    nombre  edad
a     mayu    16
b  shirley    29
c     ines    24

In [127]:
# df.loc[df.calificaciones > 5]
df.loc[df.calificaciones > 5, ['nombre','edad']]

    nombre  edad
a     mayu    16
b  shirley    29
c     ines    24
d   karina    18
e   marilu    23

In [128]:
df.loc[df.calificaciones > 5, ['nombre','edad','calificaciones']
      ].sort_values('calificaciones', ascending=False).head(2)

    nombre  edad  calificaciones
b  shirley    29               8
e   marilu    23               8

## iloc

In [129]:
df = pd.DataFrame(usuarios, index=list('abcde'))
df

    nombre  calificaciones  edad       email  aprobado
a     mayu               7    16     mayu@aa      True
b  shirley               8    29  shirley@aa     False
c     ines               7    24     ines@bb      True
d   karina               7    18   karina@bb      True
e   marilu               8    23   marilu@aa     False

In [130]:
df.iloc[0:4,1:3]

   calificaciones  edad
a               7    16
b               8    29
c               7    24
d               7    18

In [131]:
df.iloc[0:4,[0,2]]

    nombre  edad
a     mayu    16
b  shirley    29
c     ines    24
d   karina    18

## EXAMPLE

In [132]:
userdf = pd.read_csv('./datasets/users.csv', usecols=['nombre','edad','genero','pais','email'])
userdf.head(3)

             nombre  edad genero            pais                      email
0  Mr Jerome Thomas    73   male   United States  jerome.thomas@example.com
1     Mr Gary Berry    70   male  United Kingdom     gary.berry@example.com
2   Mr Noham Dubois    40   male          France   noham.dubois@example.com

In [133]:
# userdf[userdf['edad'] > 70].nombre
userdf.loc[userdf['edad'] > 70,'nombre']

0         Mr Jerome Thomas
13      Mr Gerardo Garrido
17       Mr Grayson Walker
19       Ms Asta Jørgensen
24       Mr Leo Montgomery
29        Mr Ilyès Lemaire
43        Miss Anna Hansen
82     Miss Elsie Lawrence
84        Mr Jordan Castro
90          Ms Emilia Vega
108          Mr كيان احمدی
126        Mr Eliott Andre
129      Mr Davut Mertoğlu
135           Mr Ray Henry
152        Mr Edward Brown
153       Mrs Sophie Lewis
Name: nombre, dtype: object

In [137]:
userdf.loc[(userdf['edad'] > 70) & (userdf.genero == 'female') ,'nombre']

19       Ms Asta Jørgensen
43        Miss Anna Hansen
82     Miss Elsie Lawrence
90          Ms Emilia Vega
153       Mrs Sophie Lewis
Name: nombre, dtype: object

In [139]:
userdf.loc[userdf['email'].str.endswith('@gmail.com'),'nombre']

151    Mr Thomas Lam
Name: nombre, dtype: object

In [140]:
userdf.loc[~userdf['email'].str.endswith('@gmail.com'),'nombre']

0        Mr Jerome Thomas
1           Mr Gary Berry
2         Mr Noham Dubois
3       Mrs Naja Johansen
4      Mr Damien Marchand
              ...
195         Mr Raul Bravo
196     Miss Maeva Fortin
197     Mr Gabriel Berger
198    Mrs Ülkü Tanrıkulu
199       Mr Raff Valkema
Name: nombre, Length: 199, dtype: object

In [143]:
(userdf.loc[userdf['pais'].isin(['Germany','Finland','Canada']),['nombre','pais']]).head(3)

                 nombre     pais
5      Mr Harri Althoff  Germany
7     Ms Britta Weinert  Germany
9  Miss Emilia Laitinen  Finland

In [149]:
userdf.loc[(userdf['edad'] > 20) & (
    userdf.genero == 'female') & (
    userdf['pais'].isin(['Germany','Finland','Canada'])
),['nombre','email','pais']]

                     nombre                            email     pais
7         Ms Britta Weinert       britta.weinert@example.com  Germany
9      Miss Emilia Laitinen      emilia.laitinen@example.com  Finland
38        Mrs Lotta Rintala        lotta.rintala@example.com  Finland
41         Miss Iida Ketola          iida.ketola@example.com  Finland
45        Ms Ilona Moilanen       ilona.moilanen@example.com  Finland
47         Miss Ellen Rinne          ellen.rinne@example.com  Finland
53          Ms Aino Lassila         aino.lassila@example.com  Finland
56       Ms Marcella Brosch      marcella.brosch@example.com  Germany
58       Miss Madison Ennis        madison.ennis@example.com   Canada
72           Ms Megan Brown          megan.brown@example.com   Canada
79   Ms Hanne Aschenbrenner  hanne.aschenbrenner@example.com  Germany
85       Mrs Luisa Weißmann      luisa.weissmann@example.com  Germany
88            Mrs Hilda Epp            hilda.epp@example.com  Germany
133      Miss Julia Ambrose        julia.ambrose@example.com   Canada
144        Ms Mareile Plate        mareile.plate@example.com  Germany
174       Ms Isla Koistinen       isla.koistinen@example.com  Finland
193     Ms Delphine Ginnish     delphine.ginnish@example.com   Canada
196       Miss Maeva Fortin         maeva.fortin@example.com   Canada

In [151]:
userdf.sort_values('edad', ascending=False).head(8)

,nombre,edad,genero,pais,email
82,Miss Elsie Lawrence,75,female,Australia,elsie.lawrence@example.com
29,Mr Ilyès Lemaire,75,male,France,ilyes.lemaire@example.com
135,Mr Ray Henry,75,male,United States,ray.henry@example.com
153,Mrs Sophie Lewis,75,female,New Zealand,sophie.lewis@example.com
13,Mr Gerardo Garrido,74,male,Spain,gerardo.garrido@example.com
84,Mr Jordan Castro,74,male,Australia,jordan.castro@example.com
129,Mr Davut Mertoğlu,74,male,Turkey,davut.mertoglu@example.com
17,Mr Grayson Walker,74,male,New Zealand,grayson.walker@example.com

Agrupamiento

In [152]:
frutas = {
    'nombre':['Naranja','Manzana','Manzana','Pera','Naranja','Manzana','Sandia'],
    'color':['Naranja','Rojo','Verde','Verde','Naranja','Rojo','Rojo'],
    'cantidad': np.random.randint(5,10,7),
    'precio': np.random.randint(1,5,7),
}

In [154]:
fruitdf = pd.DataFrame(frutas)
fruitdf

    nombre    color  cantidad  precio
0  Naranja  Naranja         8       3
1  Manzana     Rojo         5       3
2  Manzana    Verde         8       1
3     Pera    Verde         6       1
4  Naranja  Naranja         6       2
5  Manzana     Rojo         9       1
6   Sandia     Rojo         5       2

In [155]:
fruitdf.groupby('nombre')

In [156]:
fruitdf.groupby('nombre').cantidad.sum()

nombre
Manzana    22
Naranja    14
Pera        6
Sandia      5
Name: cantidad, dtype: int32

In [157]:
fruitdf.groupby('nombre').cantidad.sum().to_frame('cantidad') # to_frame <> Crear un new dataframe

         cantidad
nombre
Manzana        22
Naranja        14
Pera            6
Sandia          5

In [159]:
fruitdf.groupby('nombre').filter(lambda fruta: fruta.cantidad.sum() > 10)

    nombre    color  cantidad  precio
0  Naranja  Naranja         8       3
1  Manzana     Rojo         5       3
2  Manzana    Verde         8       1
4  Naranja  Naranja         6       2
5  Manzana     Rojo         9       1

In [160]:
fruitdf.groupby('nombre').filter(lambda fruta: fruta.cantidad.sum() > 10
                                ).groupby('nombre').cantidad.sum()

nombre
Manzana    22
Naranja    14
Name: cantidad, dtype: int32

In [162]:
fruitdf[fruitdf.nombre == 'Manzana'].groupby('color').cantidad.sum()

color
Rojo     14
Verde     8
Name: cantidad, dtype: int32